###################################################################

# Created by write_sdc on Sun Aug 3 17:36:28 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
create_clock [get_ports clk]  -name clock  -period 1  -waveform {0 0.5}
set_false_path   -from [get_ports resetn]
set_input_delay -clock clock  0  [get_ports clk]
set_input_delay -clock clock  0  [get_ports resetn]
set_input_delay -clock clock  0  [get_ports {Wq_CIN_FP[7]}]
set_input_delay -clock clock  0  [get_ports {Wq_CIN_FP[6]}]
set_input_delay -clock clock  0  [get_ports {Wq_CIN_FP[5]}]
set_input_delay -clock clock  0  [get_ports {Wq_CIN_FP[4]}]
set_input_delay -clock clock  0  [get_ports {Wq_CIN_FP[3]}]
set_input_delay -clock clock  0  [get_ports {Wq_CIN_FP[2]}]
set_input_delay -clock clock  0  [get_ports {Wq_CIN_FP[1]}]
set_input_delay -clock clock  0  [get_ports {Wq_CIN_FP[0]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[31]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[30]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[29]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[28]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[27]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[26]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[25]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[24]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[23]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[22]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[21]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[20]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[19]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[18]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[17]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[16]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[15]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[14]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[13]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[12]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[11]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[10]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[9]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[8]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[7]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[6]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[5]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[4]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[3]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[2]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[1]}]
set_input_delay -clock clock  0  [get_ports {T_CIN_TC[0]}]
set_input_delay -clock clock  0  [get_ports A_Vld_CIN]
set_input_delay -clock clock  0  [get_ports WqLock]
set_output_delay -clock clock  0  [get_ports {Wq_COUT_FP[7]}]
set_output_delay -clock clock  0  [get_ports {Wq_COUT_FP[6]}]
set_output_delay -clock clock  0  [get_ports {Wq_COUT_FP[5]}]
set_output_delay -clock clock  0  [get_ports {Wq_COUT_FP[4]}]
set_output_delay -clock clock  0  [get_ports {Wq_COUT_FP[3]}]
set_output_delay -clock clock  0  [get_ports {Wq_COUT_FP[2]}]
set_output_delay -clock clock  0  [get_ports {Wq_COUT_FP[1]}]
set_output_delay -clock clock  0  [get_ports {Wq_COUT_FP[0]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[31]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[30]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[29]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[28]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[27]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[26]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[25]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[24]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[23]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[22]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[21]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[20]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[19]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[18]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[17]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[16]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[15]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[14]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[13]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[12]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[11]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[10]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[9]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[8]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[7]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[6]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[5]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[4]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[3]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[2]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[1]}]
set_output_delay -clock clock  0  [get_ports {T_COUT_TC[0]}]
set_output_delay -clock clock  0  [get_ports A_Vld_COUT]
set_output_delay -clock clock  0  [get_ports {R_FP[31]}]
set_output_delay -clock clock  0  [get_ports {R_FP[30]}]
set_output_delay -clock clock  0  [get_ports {R_FP[29]}]
set_output_delay -clock clock  0  [get_ports {R_FP[28]}]
set_output_delay -clock clock  0  [get_ports {R_FP[27]}]
set_output_delay -clock clock  0  [get_ports {R_FP[26]}]
set_output_delay -clock clock  0  [get_ports {R_FP[25]}]
set_output_delay -clock clock  0  [get_ports {R_FP[24]}]
set_output_delay -clock clock  0  [get_ports {R_FP[23]}]
set_output_delay -clock clock  0  [get_ports {R_FP[22]}]
set_output_delay -clock clock  0  [get_ports {R_FP[21]}]
set_output_delay -clock clock  0  [get_ports {R_FP[20]}]
set_output_delay -clock clock  0  [get_ports {R_FP[19]}]
set_output_delay -clock clock  0  [get_ports {R_FP[18]}]
set_output_delay -clock clock  0  [get_ports {R_FP[17]}]
set_output_delay -clock clock  0  [get_ports {R_FP[16]}]
set_output_delay -clock clock  0  [get_ports {R_FP[15]}]
set_output_delay -clock clock  0  [get_ports {R_FP[14]}]
set_output_delay -clock clock  0  [get_ports {R_FP[13]}]
set_output_delay -clock clock  0  [get_ports {R_FP[12]}]
set_output_delay -clock clock  0  [get_ports {R_FP[11]}]
set_output_delay -clock clock  0  [get_ports {R_FP[10]}]
set_output_delay -clock clock  0  [get_ports {R_FP[9]}]
set_output_delay -clock clock  0  [get_ports {R_FP[8]}]
set_output_delay -clock clock  0  [get_ports {R_FP[7]}]
set_output_delay -clock clock  0  [get_ports {R_FP[6]}]
set_output_delay -clock clock  0  [get_ports {R_FP[5]}]
set_output_delay -clock clock  0  [get_ports {R_FP[4]}]
set_output_delay -clock clock  0  [get_ports {R_FP[3]}]
set_output_delay -clock clock  0  [get_ports {R_FP[2]}]
set_output_delay -clock clock  0  [get_ports {R_FP[1]}]
set_output_delay -clock clock  0  [get_ports {R_FP[0]}]
